<template>
    <div class="box">
        <p class="is-size-5">
            Проект SolStat - український стартап, напрямлений на полегшення роботи з Вашою сонячною електростанцією
            шляхом зручного виведення статистики її роботи на будь-який зручний для Вас гаджет у будь-який момент.
            Данні прораховуються надзвичайно швидко, а завдяки гарно оптимізованій системі Вам не доведеться довго
            чекати на результати, на відміну від наших конкурентів. Вся статистика виводиться в максимально зручному
            для аналізування вигляді. А зручні інтерактивні графіки доповнюють цю картину.
        </p>
        <hr>
        <h2 class="title">Переваги сервісу SolStat</h2>
        <div class="advantages">
            <h3 class="subtitle">Початок роботи</h3>
            Розпочати роботу з нашим сервісом надзвичайно просто: Вам необхідно всього лише <router-link to="/signup">
            зареєструватись, відповівши на декілька простих запитань в анкеті.</router-link> Після цього у Вас буде
            змога завантажити файл статистики на сервер і одразу після цього приступити до роботи з обробленими данними
            статистики роботи Вашої сонячної електростанції. А розібратись з надзвичайно простим і зручним інтерфейсом
            буквально за 1-2 хвилини не стане проблемою навіть для людини, яка має лише базовий досвід роботи
            з сучасними технологіями.
            <br><br>
            Увесь цей процес по часу займає близько 5-ти хвилин, адже користувацький інтерфейс був максимально
            оптимізований згідно сучасних потреб і стандартів розробки веб-сервісів.
            <br><br>
            <hr>
            <h3 class="subtitle">Зручний дизайн</h3>
            Зручний, сучасний і мінімалістичний Матеріальний Дизайн дозволяє легко знаходити необхідні елементи для
            взаємодії з продуктом, на відміну від деяких продуктів, якими надзвичайно складно користуватись, адже
            знайти потрібний елемент іноді займає до декількох хвилин! Натомість тут Ви не знайдете нічого зайвого,
            адже цей проект створювався задля полегшення роботи із статистикою роботи сонячної електростанції,
            а отже нашим обов'язком є зробити цей продукт максимально простим і зручним для користувача.
            <br><br>
            <hr>
            <h3 class="subtitle">Адаптивність. Робота з різних пристроїв</h3>
            Також варто згадати про адаптивність нашого продукту. Сервіс SolStat працює без усіляких проблем і збоїв
            на різних типах дивайсів: планшет, телефон, комп'ютер, ноутбук - не важливо. Додаток було створено таким
            чином, щоб працювати з ним можна було з абсолютно будь-якого зручного для користувача пристроєм.
            Компоненти сайту перебудовуються в залежності від девайсу, з якого на сервіс увійшов користувач, адже,
            якщо вірити сучасній статистиці, то до 80% інтернет-трафіку приходиться на мобільні пристрої. Отже
            адаптивність є одним з найголовніших аспектів спрощення роботи з нашим сервісом.
            <br><br>
            <hr>
            <h3 class="subtitle">Швидкість роботи</h3>
            Данні на графіках виводяться максимально швидко, сучасні сервери дозволяють підтримувати
            швидку взаємодію з клієнтом, завдяки чому Вам не доведеться чекати по декілька секунд, а то і хвилин, для
            того, щоб статистика на графіку оновилась. Однак причиною довгого завантаження данних не рідко
            стає повільний інтернет користувача. Але і це не є проблемою - данні надсилаються в максимально
            оптимізованому вигляді, що дозволяє завантажувати і виводити статистику навіть знаходячись в лісі з
            дуже слабким покриттям мобільної мережі.
            <br>
            Алгоритми програмного продукту прописані без зайвих деталей, що дозволяє коду програми бути максимально
            швидким в завантаженні на клієнт.
            <br>
            В загальному на вивід статистики на екран в вигляді графіку йде не більш, як пів секунди, навіть якщо це
            слабкий телефон, а статистики виводиться дуже багато.
            <br><br>
            <hr>
            <h3 class="subtitle">Зручне керівництво з користування продуктом</h3>
            Сторінка <router-link to="/howtouse">як користуватись сервісом</router-link> дозволяє швидко і просто
            розібратись з усіма елементами сервісу. Там ви побачите детальний опис усіх компонентів додатку,
            навчитесь працювати з інтерактивними графіками, використовувати поля для введення діапазону дат
            виведення статистики, працювати з форматом виведення данних та зрозумієте, наскільки просто працювати
            з сервісом SolStat.
            <br><br>
            <hr>
            <h3 class="subtitle">Простота у використанні</h3>
            Сервіс SolStat надзвичайно простий у використанні. Цим можна завдячити згаданому вище Матеріальному
            Дизайну, який забезпечує просту роботу з користувацьким інтерфесом. Легкі форми реєстрації, на заповнення
            яких йде не більш, як 1-2 хвилини, проста система роботи з графіком статистики роботи SPS, яка потребує
            не більше тих самих 1-2 хвилин для того, щоб з нею розібратись. Все це забеспечує надзвичайно низький
            поріг "професійності" використання сучасних технологій і дозволяє працювати з сервісом практично будь-кому.
        </div>
    </div>
</template>

<script>
    export default {}
</script>