<template>
    <div class="box container">
        <div class="signin">
            <h2 class="title">Реєстрація, вхід</h2>
            <div class="content">
                Аби зареєструватись на нашому сервісі Вам необхідно всього лише перейти на
                <router-link to="/signup">сторінку реєстрації</router-link>
                і заповнити просту форму, яка складається
                із 6 полів:
                <br>
                <img src="Images/signup.png" alt="sign up page">
                <br>
                Якщо Ви наразі вже зареєстровані, то для входу Вам потрібно авторизуватися на сервісі. Це Ви можете
                зробити на
                <router-link to="/login">сторінці авторизації</router-link>
                :
                <br>
                <img src="Images/login.png" alt="log in page">
            </div>
        </div>
        <hr>
        <div class="upload" id="upload">
            <h2 class="title">Завантаження файлу</h2>
            <div class="content">
                Перед початком роботи зі статистикою Вам необхідно завантажити файл зі статистикою роботи
                Вашої сонячної електростанції. Цей файл Ви можете завантажити з інвертора на Вашій SPS,
                після чого на сторінці
                <router-link to="/info" v-if="logged">Панель інформації</router-link>
                <router-link to="/login" v-else>Панель інформації (Авторизуйтесь для переходу на цю сторінку)
                </router-link>
                завантажте цей файл на сервіс:
                <br>
                <img src="Images/upload.png" alt="">
                <br>
                <span class="is-red">*Важливо: </span> виведення статистики не працюватиме, якщо Ви не завантажите
                файл статистики!
            </div>
        </div>
        <hr>
        <div class="stats">
            <h2 class="title">Робота зі статистикою</h2>
            <div class="content">
                Після того, як Ви <a href="#upload" class="is-link">завантажили файл статистики</a>, Ви можете
                приступати до найцікавішої частини роботи: перегляд статистики роботи Вашої сонячної електростанції.
                Для цього перейдіть на сторінку
                <router-link to="/statistic" v-if="logged">статистики</router-link>
                <router-link to="/login" v-else>статистики (Авторизуйтесь для переходу на цю сторінку)</router-link>
                .
                <br><br>
                На цій сторінці ви можете побачити такий елемент, як усереднена статистика роботи Вашої сонячної
                електростанції:
                <br><br>
                <img src="Images/avarageStat.png" alt="avarage statistic">
                <br>
                Тут представлена узагальнена статистика роботи SPS. А саме такі елементи:
            </div>
            <ol>
                <li>
                    <b>Виробіток за весь час.</b> Тут Ви можете побачити, скільки електроенергії виробила Ваша
                    електростанція за весь проміжок вирахування статистики інвертором
                </li>
                <li>
                    <b>Середній щомісячний виробіток.</b> В цьому рядку знаходиться усереднене значення виробітку
                    електроенергії за усі місяці
                </li>
                <li>
                    <b>Середній щоденний виробіток.</b> Тут знаходиться інформація про середнє значення виробітку
                    електроенергія за усі дні
                </li>
                <li>
                    <b>Середній щогодинний виробіток.</b> Усереднене значення щогодинного виробітку електроенергії
                    за увесь час
                </li>
            </ol>
            <hr>
            <h2 class="title">Вибір діапазону</h2>
            <div class="content">
                Трохи нижче ви можете побачити два поля для вибору дати: для вибору дати, від якої буде йти відлік
                і до якої буде йти відлік відповідно.
                <br>
                Тут ви можете обрати діапазон дат, які будуть виводитись на графіку трохи нижче на цій же сторінці.
                <br>
                Також тут можна обрати формат данних, які будуть виводитись на графіку:
                <ol>
                    <li><b>Години</b></li>
                    <li><b>Дні</b></li>
                    <li><b>Місяці</b></li>
                </ol>
                В залежності від обраного формату, на графіку ви побачите данні різного періоду збору данних.
                Наприклад, обравши варіант "Години" ви зможете побачити погодинну статистику виробітку електроенергії
                сонячної електростанції і наглядно помітити, як впливає на виробіток енергії час доби, погодні умови
                чи навіть сонячні затемнення.
                <br>
                <img src="Images/datepicker.png" alt="datepicker">
                <br>
            </div>
            <hr>
            <h2 class="title">Графік</h2>
            <div class="content">
                Після натискання на кнопку "Оновити статистику" ви побачите, як змінюється графік в залежності
                від вибраних Вами трохи вище параметрів. За замовчуванням на графіку виводиться остання доба, яку
                записував інвертор. Приклад такого графіку Ви можете побачити на цьому фото:
                <br>
                <img src="Images/graph.png" alt="example of graph">
                <br>
                Більш точнішу інформацію про певну точку на графіку Ви можете дізнатись просто навівши курсор
                миші на точку, яка Вас цікавить:
                <br>
                <img src="Images/graphHover.png" alt="example of graph, when we hover on point">
                <br>
                На данному графіку ми можемо побачити декілька корисних можливостей сервісу: одна з них - вивід
                на екран в надзвичайному простому і зручному вигляді усіх найдетальніших даних статистики роботи
                сонячної електростанції, а також ми можемо легко порівнювати виробіток декількох днів погодинно.
                Відтак ми можемо легко помітити, коли погодні умови краще сприяли електростанції у виробітку
                електроенергії, а коли вони навпаки - заважали цьому процесу.
            </div>
        </div>
    </div>
</template>

<script>
    export default {
        name: 'howtouse',
        computed: {
            logged() {
                return this.$store.getters.isAuthenticated
            }
        }
    }
</script>

<style>
    .info-panel {
        display: inline;
    }

    .is-red {
        color: red;
    }

    .content {
        font-size: 1.1em !important;
    }
</style>